Revit 2027 API
FormatOptions.UseDigitGrouping Property
 Indicates if digit grouping symbols should be displayed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool UseDigitGrouping { get; set; }
Public Property UseDigitGrouping As Boolean
	Get
	Set
public:
property bool UseDigitGrouping {
	bool get ();
	void set (bool value);
}
member UseDigitGrouping : bool with get, set
Property Value
Boolean
 True if digit grouping symbols should be displayed, false otherwise. The default is false.
Exceptions
Exception | Condition
InvalidOperationException |  UseDefault is true in this FormatOptions.
Remarks
 When UseDigitGrouping is true, digit grouping symbols (i.e. thousands separators) will be displayed when needed. For example, 123456789.00 may be displayed as 123,456,789.00. The precise display is determined by the DigitGroupingSymbol and DigitGroupingAmount properties of the Units class.
See Also
Reference
FormatOptions Class
Autodesk.Revit.DB Namespace